161 49835
1076 17
89 131
34 40
1110 163
1055 42
68 117
1089 11
102 107
47 84
1068 133
1102 34
115 73
1047 75
60 135
1081 29
39 149
73 94
1060 96
1094 35
107 125
52 83
1073 27
86 130
120 153
1052 49
65 93
1086 5
99 97
44 20
78 115
1065 155
167 161
1099 23
112 98
1044 53
57 72
8220 139
1078 30
91 151
1057 41
70 148
1091 18
104 86
49 50
8212 92
83 105
1070 113
117 74
1049 132
62 134
1083 12
41 67
1062 120
75 147
1096 33
109 95
1041 64
54 90
1075 25
88 121
33 52
122 138
1054 44
67 127
8230 154
1088 13
101 54
46 22
80 123
1067 136
1101 38
114 62
59 82
1046 110
1080 8
93 150
38 142
1025 160
1059 76
72 137
1093 31
106 156
51 80
1072 7
85 118
119 101
1051 68
1085 9
98 111
187 100
43 146
1064 106
77 124
1098 103
111 60
1043 70
56 85
1077 6
35 164
124 157
1056 57
69 116
1090 10
103 109
48 55
8211 145
1069 79
82 104
171 99
1103 21
116 58
1048 45
61 129
1082 15
95 159
40 71
1061 88
74 158
9601 4
1095 28
108 77
8470 162
1040 43
53 81
1074 14
87 143
121 87
1053 39
66 126
1087 19
100 89
45 32
79 114
1100 24
113 144
1045 65
58 56
8221 140
1079 26
37 152
1058 51
71 141
160 108
1092 48
105 63
50 61
1071 69
84 112
1105 46
118 119
1050 47
63 128
1084 16
97 59
42 102
1063 78
76 122
1097 36
110 66
1042 37
55 91
4 20 165
4 22 166
4 19 167
4 11 168
4 9 169
4 14 170
10 5 171
4 8 172
9 5 173
4 5 174
13 7 175
11 10 176
15 5 177
13 5 178
6 9 179
4 32 180
25 5 181
167 5 182
7 12 183
4 17 184
15 7 185
13 6 186
4 16 187
169 7 188
12 8 189
4 27 190
169 6 191
12 7 192
6 10 193
13 8 194
9 8 195
4 10 196
12 5 197
10 24 198
14 5 199
4 26 200
4 28 201
9 7 202
14 7 203
9 23 204
4 18 205
11 21 206
6 13 207
12 24 208
15 8 209
17 7 210
6 16 211
200 7 212
12 6 213
4 15 214
11 24 215
13 18 216
10 6 217
4 177 218
10 8 219
4 171 220
16 8 221
4 6 222
17 8 223
4 40 224
4 37 225
14 8 226
179 8 227
10 7 228
4 175 229
201 171 230
9 6 231
30 6 232
4 185 233
4 39 234
167 178 235
4 38 236
17 6 237
190 23 238
9 18 239
4 42 240
17 5 241
31 5 242
4 41 243
174 10 244
168 5 245
170 5 246
16 5 247
12 21 248
14 6 249
4 7 250
4 181 251
184 5 252
167 194 253
4 25 254
16 7 255
11 6 256
28 8 257
187 5 258
4 47 259
27 5 260
4 21 261
30 8 262
4 43 263
4 52 264
4 44 265
4 49 266
19 5 267
33 8 268
28 6 269
196 7 270
15 18 271
13 23 272
170 23 273
4 45 274
11 177 275
17 18 276
236 171 277
174 27 278
183 8 279
33 6 280
11 8 281
176 8 282
4 51 283
11 171 284
183 7 285
4 53 286
176 7 287
6 186 288
12 18 289
4 56 290
172 26 291
169 5 292
173 29 293
28 7 294
26 7 295
4 50 296
12 34 297
176 24 298
169 8 299
6 29 300
35 8 301
16 6 302
9 21 303
25 7 304
16 18 305
233 15 306
11 5 307
229 26 308
11 209 309
170 256 310
173 181 311
196 6 312
183 24 313
168 10 314
36 8 315
190 5 316
14 23 317
36 6 318
25 8 319
13 21 320
4 64 321
4 67 322
168 199 323
204 29 324
174 9 325
240 5 326
4 57 327
19 8 328
182 17 329
19 7 330
167 186 331
217 208 332
11 7 333
4 71 334
4 186 335
204 6 336
27 6 337
184 6 338
25 210 339
222 181 340
14 207 341
14 18 342
27 8 343
4 242 344
168 6 345
227 21 346
4 189 347
204 31 348
4 232 349
10 18 350
4 69 351
10 23 352
4 70 353
179 24 354
12 206 355
183 5 356
170 6 357
184 7 358
198 206 359
179 173 360
168 7 361
4 48 362
33 7 363
218 171 364
4 61 365
208 177 366
187 6 367
30 7 368
190 6 369
227 6 370
33 24 371
27 23 372
4 68 373
187 7 374
193 206 375
185 26 376
12 23 377
190 18 378
34 10 379
270 15 380
17 23 381
167 288 382
14 193 383
35 6 384
177 29 385
4 75 386
234 7 387
35 7 388
15 6 389
4 262 390
176 199 391
179 21 392
19 6 393
168 8 394
30 173 395
211 18 396
168 171 397
4 297 398
4 216 399
26 8 400
26 5 401
11 213 402
204 16 403
202 21 404
16 23 405
187 8 406
238 197 407
4 79 408
186 16 409
167 7 410
170 8 411
14 183 412
4 65 413
170 11 414
229 11 415
4 78 416
28 173 417
196 23 418
184 216 419
7 15 420
234 5 421
4 30 422
4 76 423
176 14 424
25 18 425
201 6 426
4 31 427
27 21 428
19 178 429
187 392 430
168 228 431
4 82 432
27 7 433
178 14 434
173 14 435
187 23 436
174 202 437
17 24 438
4 84 439
192 215 440
4 178 441
203 198 442
296 72 443
11 189 444
200 202 445
11 18 446
19 18 447
168 18 448
5 9 449
173 6 450
234 6 451
17 193 452
12 193 453
195 21 454
177 14 455
184 248 456
195 6 457
170 7 458
242 223 459
238 12 460
174 17 461
177 16 462
14 268 463
225 5 464
246 26 465
172 11 466
27 18 467
214 18 468
184 18 469
187 231 470
5 27 471
286 7 472
12 179 473
197 249 474
31 7 475
4 33 476
178 16 477
220 366 478
205 232 479
173 16 480
171 16 481
10 206 482
259 5 483
275 29 484
26 23 485
175 14 486
316 208 487
4 213 488
331 17 489
11 185 490
4 88 491
36 7 492
365 55 493
170 409 494
364 272 495
9 24 496
17 21 497
189 215 498
10 21 499
239 34 500
16 179 501
175 9 502
254 192 503
275 181 504
172 31 505
201 7 506
14 173 507
176 203 508
199 29 509
187 18 510
170 26 511
265 9 512
26 18 513
196 18 514
174 195 515
247 10 516
5 13 517
167 18 518
301 8 519
34 315 520
26 202 521
16 207 522
15 272 523
266 7 524
426 474 525
332 173 526
176 18 527
14 279 528
30 193 529
386 7 530
168 197 531
218 9 532
172 9 533
197 215 534
309 29 535
25 175 536
203 21 537
14 21 538
199 194 539
195 255 540
259 7 541
176 6 542
172 16 543
172 189 544
4 99 545
4 100 546
266 5 547
218 339 548
11 281 549
14 248 550
7 9 551
4 96 552
182 402 553
11 23 554
168 289 555
183 206 556
251 197 557
201 18 558
4 102 559
167 207 560
424 179 561
222 6 562
179 7 563
237 12 564
167 8 565
323 8 566
390 26 567
252 12 568
167 175 569
195 15 570
408 171 571
223 9 572
239 12 573
19 207 574
171 14 575
176 226 576
361 247 577
229 260 578
176 178 579
4 92 580
284 21 581
283 5 582
17 173 583
222 318 584
48 8 585
11 267 586
19 23 587
321 5 588
251 210 589
28 18 590
327 5 591
238 192 592
356 215 593
230 372 594
269 309 595
278 175 596
33 5 597
11 173 598
204 221 599
11 15 600
25 248 601
241 16 602
214 175 603
369 26 604
168 376 605
285 215 606
30 17 607
25 192 608
235 8 609
174 287 610
494 21 611
218 16 612
31 8 613
28 354 614
358 232 615
203 9 616
243 5 617
15 175 618
4 35 619
314 175 620
345 428 621
30 179 622
178 29 623
170 207 624
188 28 625
182 289 626
188 11 627
222 444 628
182 11 629
236 219 630
15 171 631
4 396 632
28 24 633
182 12 634
183 6 635
222 298 636
238 189 637
167 6 638
219 14 639
414 46 640
231 29 641
190 7 642
176 186 643
167 192 644
201 211 645
6 14 646
168 213 647
255 9 648
254 237 649
169 18 650
4 93 651
205 11 652
10 173 653
4 80 654
234 8 655
16 193 656
66 58 657
213 15 658
35 23 659
6 371 660
176 342 661
416 171 662
185 221 663
10 175 664
9 17 665
178 17 666
203 193 667
209 6 668
19 175 669
234 18 670
25 6 671
378 452 672
174 614 673
13 24 674
327 7 675
185 295 676
171 305 677
184 8 678
269 181 679
33 18 680
196 211 681
179 6 682
191 10 683
312 428 684
182 28 685
27 175 686
4 453 687
191 181 688
258 529 689
251 539 690
17 207 691
267 12 692
54 62 693
19 186 694
30 18 695
214 171 696
260 29 697
283 23 698
235 284 699
36 46 700
222 46 701
237 192 702
201 8 703
240 194 704
177 181 705
283 7 706
227 8 707
195 8 708
246 10 709
266 8 710
225 7 711
240 178 712
362 8 713
259 420 714
4 110 715
213 29 716
6 26 717
225 23 718
176 23 719
4 192 720
6 181 721
503 295 722
199 13 723
33 185 724
4 106 725
270 16 726
265 202 727
19 194 728
185 21 729
13 219 730
277 181 731
10 207 732
231 6 733
379 206 734
4 55 735
21 198 736
168 177 737
493 50 738
35 5 739
216 25 740
14 171 741
317 29 742
238 198 743
516 186 744
277 16 745
63 66 746
27 189 747
294 11 748
195 29 749
195 185 750
243 7 751
237 29 752
279 215 753
10 194 754
233 30 755
168 267 756
209 31 757
353 5 758
195 16 759
220 181 760
280 12 761
4 197 762
59 66 763
249 17 764
300 748 765
12 211 766
225 6 767
86 54 768
9 193 769
4 209 770
345 337 771
397 178 772
182 241 773
9 173 774
266 23 775
19 486 776
271 34 777
176 175 778
298 34 779
283 420 780
174 15 781
4 289 782
12 346 783
237 215 784
59 77 785
280 29 786
338 192 787
177 6 788
186 17 789
30 183 790
317 6 791
46 16 792
288 26 793
182 247 794
4 104 795
574 24 796
209 29 797
312 337 798
11 192 799
286 5 800
30 210 801
213 6 802
254 216 803
251 276 804
177 9 805
14 285 806
208 173 807
313 173 808
182 303 809
239 355 810
422 179 811
196 186 812
429 281 813
188 241 814
301 21 815
60 62 816
48 6 817
287 226 818
225 256 819
244 383 820
4 384 821
184 193 822
299 31 823
222 700 824
225 8 825
240 7 826
184 354 827
173 226 828
24 21 829
487 280 830
26 21 831
258 395 832
220 16 833
210 13 834
245 14 835
8 12 836
174 11 837
490 21 838
227 29 839
35 18 840
344 178 841
46 10 842
514 10 843
491 5 844
227 211 845
277 10 846
309 31 847
196 216 848
257 10 849
168 207 850
187 311 851
265 10 852
209 16 853
36 18 854
194 8 855
464 10 856
21 10 857
424 360 858
28 179 859
376 23 860
220 232 861
241 14 862
299 679 863
280 181 864
4 83 865
87 74 866
415 11 867
28 185 868
8 9 869
463 215 870
73 58 871
173 203 872
419 181 873
13 179 874
217 186 875
196 8 876
317 31 877
239 192 878
567 195 879
13 10 880
605 183 881
495 29 882
493 55 883
378 276 884
182 26 885
182 197 886
8 10 887
9 34 888
46 9 889
4 81 890
182 481 891
197 16 892
172 302 893
203 454 894
4 113 895
4 58 896
278 103 897
175 21 898
275 16 899
310 31 900
4 363 901
193 6 902
168 765 903
15 297 904
59 58 905
33 192 906
241 12 907
591 549 908
200 784 909
174 572 910
74 62 911
227 34 912
307 27 913
200 211 914
222 29 915
495 6 916
172 284 917
168 538 918
275 366 919
4 128 920
287 14 921
28 211 922
11 211 923
188 17 924
191 16 925
30 276 926
33 209 927
323 300 928
525 15 929
188 16 930
258 25 931
254 175 932
12 370 933
283 6 934
178 181 935
307 14 936
168 15 937
201 793 938
191 29 939
176 173 940
174 260 941
419 319 942
199 181 943
9 183 944
168 383 945
16 195 946
108 92 947
167 197 948
214 178 949
182 185 950
316 802 951
373 8 952
11 11 953
28 209 954
301 449 955
17 179 956
184 203 957
33 189 958
382 17 959
254 18 960
558 14 961
174 176 962
17 303 963
14 175 964
4 124 965
24 34 966
244 523 967
4 60 968
185 31 969
231 417 970
184 300 971
4 129 972
170 643 973
343 175 974
344 217 975
217 248 976
192 181 977
4 94 978
46 12 979
174 13 980
197 14 981
29 219 982
7 13 983
247 395 984
250 741 985
10 178 986
412 206 987
168 211 988
239 10 989
36 300 990
203 359 991
567 496 992
199 6 993
312 796 994
176 21 995
4 62 996
323 34 997
318 181 998
310 181 999
299 16 1000
4 126 1001
609 26 1002
21 215 1003
171 29 1004
30 370 1005
258 197 1006
214 186 1007
170 302 1008
310 339 1009
4 90 1010
251 178 1011
205 226 1012
258 425 1013
317 16 1014
199 223 1015
413 444 1016
237 189 1017
4 320 1018
195 455 1019
555 294 1020
17 388 1021
8 16 1022
59 62 1023
510 30 1024
203 375 1025
247 29 1026
168 23 1027
182 21 1028
220 10 1029
26 210 1030
265 195 1031
811 315 1032
296 85 1033
246 29 1034
398 343 1035
309 6 1036
217 194 1037
219 21 1038
168 813 1039
471 175 1040
242 497 1041
176 249 1042
4 107 1043
347 371 1044
296 55 1045
361 16 1046
201 207 1047
167 23 1048
190 175 1049
186 29 1050
782 28 1051
239 198 1052
4 105 1053
4 120 1054
199 17 1055
15 219 1056
335 268 1057
357 438 1058
4 280 1059
241 29 1060
214 195 1061
314 183 1062
511 601 1063
5 202 1064
287 550 1065
205 377 1066
214 194 1067
459 10 1068
60 66 1069
203 457 1070
195 209 1071
8 26 1072
263 658 1073
263 9 1074
175 513 1075
669 226 1076
4 98 1077
553 17 1078
426 181 1079
277 29 1080
4 127 1081
220 339 1082
29 217 1083
196 207 1084
234 193 1085
4 112 1086
191 919 1087
196 194 1088
48 517 1089
257 202 1090
246 11 1091
214 216 1092
17 211 1093
531 203 1094
12 360 1095
28 193 1096
203 219 1097
4 101 1098
246 429 1099
196 199 1100
252 178 1101
226 28 1102
30 346 1103
458 11 1104
190 178 1105
4 34 1106
244 173 1107
170 171 1108
184 288 1109
307 16 1110
4 123 1111
527 19 1112
235 907 1113
250 13 1114
4 95 1115
259 18 1116
520 29 1117
254 289 1118
312 31 1119
191 5 1120
231 35 1121
626 257 1122
276 16 1123
15 192 1124
363 21 1125
199 26 1126
398 752 1127
301 34 1128
18 10 1129
250 9 1130
194 21 1131
218 178 1132
34 215 1133
33 197 1134
168 328 1135
170 192 1136
461 202 1137
398 260 1138
179 23 1139
5 197 1140
414 211 1141
228 9 1142
217 716 1143
196 175 1144
46 13 1145
252 255 1146
170 17 1147
245 27 1148
361 405 1149
397 21 1150
187 183 1151
182 677 1152
483 339 1153
270 385 1154
210 198 1155
278 192 1156
17 183 1157
338 342 1158
275 6 1159
299 177 1160
676 198 1161
274 26 1162
286 6 1163
174 25 1164
463 29 1165
268 31 1166
11 197 1167
182 540 1168
182 189 1169
254 7 1170
28 183 1171
367 926 1172
63 58 1173
26 6 1174
448 318 1175
373 6 1176
190 189 1177
19 197 1178
196 21 1179
469 255 1180
447 282 1181
167 320 1182
10 211 1183
410 13 1184
228 198 1185
323 29 1186
185 9 1187
168 393 1188
971 576 1189
312 213 1190
242 17 1191
168 247 1192
190 977 1193
458 16 1194
179 10 1195
13 34 1196
4 85 1197
4 86 1198
236 228 1199
203 194 1200
239 440 1201
168 330 1202
211 5 1203
525 185 1204
4 97 1205
4 272 1206
373 34 1207
380 232 1208
240 193 1209
321 6 1210
77 54 1211
186 223 1212
11 195 1213
205 294 1214
4 73 1215
178 6 1216
182 337 1217
398 223 1218
327 18 1219
569 226 1220
174 19 1221
16 21 1222
170 206 1223
213 26 1224
4 134 1225
11 393 1226
4 135 1227
182 38 1228
467 438 1229
168 302 1230
835 923 1231
501 10 1232
278 6 1233
168 192 1234
9 10 1235
273 307 1236
243 207 1237
344 499 1238
323 721 1239
443 72 1240
168 702 1241
203 379 1242
262 12 1243
318 6 1244
566 31 1245
184 226 1246
685 219 1247
249 194 1248
245 12 1249
445 34 1250
377 33 1251
266 6 1252
533 875 1253
199 16 1254
218 12 1255
211 23 1256
245 341 1257
314 18 1258
1066 27 1259
373 7 1260
190 8 1261
168 185 1262
62 60 1263
55 55 1264
217 189 1265
28 271 1266
243 8 1267
233 385 1268
16 227 1269
399 11 1270
189 9 1271
452 24 1272
269 484 1273
246 12 1274
27 178 1275
4 72 1276
4 121 1277
205 223 1278
265 17 1279
187 173 1280
520 31 1281
10 183 1282
33 179 1283
167 486 1284
326 402 1285
299 1229 1286
596 401 1287
171 13 1288
188 18 1289
168 1075 1290
685 396 1291
471 318 1292
258 12 1293
652 393 1294
218 648 1295
18 13 1296
12 46 1297
260 13 1298
9 211 1299
266 231 1300
27 320 1301
488 25 1302
441 223 1303
374 268 1304
6 15 1305
6 31 1306
399 209 1307
170 175 1308
650 395 1309
168 522 1310
4 91 1311
492 21 1312
258 29 1313
201 193 1314
231 11 1315
461 173 1316
299 185 1317
362 517 1318
184 342 1319
187 193 1320
168 872 1321
338 197 1322
27 297 1323
980 304 1324
261 550 1325
342 34 1326
214 192 1327
19 192 1328
173 15 1329
841 597 1330
368 198 1331
236 15 1332
897 21 1333
520 6 1334
28 285 1335
31 18 1336
54 73 1337
413 181 1338
384 14 1339
245 697 1340
28 293 1341
205 343 1342
612 202 1343
11 777 1344
321 7 1345
527 328 1346
647 276 1347
174 376 1348
176 207 1349
327 6 1350
41 41 1351
240 18 1352
357 189 1353
1008 542 1354
11 289 1355
184 341 1356
54 66 1357
465 984 1358
250 15 1359
328 333 1360
1160 339 1361
494 227 1362
367 284 1363
218 13 1364
184 207 1365
320 17 1366
253 303 1367
60 58 1368
15 186 1369
259 8 1370
203 29 1371
168 744 1372
321 18 1373
235 639 1374
184 313 1375
4 89 1376
182 242 1377
511 21 1378
18 16 1379
251 13 1380
221 202 1381
195 211 1382
191 177 1383
168 217 1384
503 14 1385
233 13 1386
242 14 1387
231 181 1388
587 10 1389
419 25 1390
391 16 1391
446 834 1392
212 656 1393
174 269 1394
30 381 1395
207 10 1396
261 485 1397
4 116 1398
595 31 1399
345 181 1400
245 1030 1401
11 333 1402
205 189 1403
258 8 1404
188 459 1405
175 226 1406
41 51 1407
199 208 1408
427 18 1409
262 210 1410
245 581 1411
216 34 1412
33 346 1413
170 540 1414
167 213 1415
268 29 1416
218 970 1417
217 175 1418
191 260 1419
4 268 1420
239 14 1421
468 210 1422
364 898 1423
278 23 1424
10 279 1425
1147 740 1426
168 219 1427
171 15 1428
203 34 1429
193 8 1430
364 623 1431
63 59 1432
26 17 1433
1018 602 1434
866 657 1435
1435 866 1436
267 197 1437
168 1161 1438
191 6 1439
349 192 1440
177 192 1441
4 194 1442
568 30 1443
28 207 1444
427 7 1445
4 139 1446
281 189 1447
191 267 1448
269 504 1449
188 26 1450
543 360 1451
226 12 1452
308 181 1453
383 7 1454
205 257 1455
4 59 1456
314 178 1457
263 665 1458
9 179 1459
36 179 1460
199 320 1461
278 318 1462
4 13 1463
28 324 1464
315 29 1465
28 370 1466
205 30 1467
629 744 1468
188 33 1469
286 18 1470
168 19 1471
220 12 1472
528 215 1473
357 215 1474
245 608 1475
173 282 1476
1400 963 1477
367 17 1478
195 34 1479
609 11 1480
291 249 1481
171 272 1482
5 10 1483
176 300 1484
191 241 1485
378 17 1486
393 175 1487
4 140 1488
4 111 1489
257 228 1490
223 198 1491
188 485 1492
406 13 1493
347 739 1494
181 539 1495
48 7 1496
10 179 1497
178 203 1498
411 223 1499
195 31 1500
205 210 1501
241 31 1502
568 181 1503
28 346 1504
631 13 1505
168 294 1506
229 29 1507
377 29 1508
33 271 1509
48 5 1510
14 24 1511
238 579 1512
237 208 1513
516 194 1514
246 1292 1515
441 17 1516
321 23 1517
243 6 1518
885 199 1519
12 189 1520
414 267 1521
57 44 1522
1279 202 1523
1151 354 1524
274 9 1525
582 366 1526
11 307 1527
566 16 1528
205 10 1529
216 262 1530
270 788 1531
74 73 1532
45 69 1533
175 15 1534
352 29 1535
212 330 1536
263 13 1537
168 564 1538
463 31 1539
329 303 1540
214 203 1541
1051 280 1542
908 8 1543
4 117 1544
362 7 1545
195 388 1546
236 350 1547
309 16 1548
281 10 1549
33 173 1550
296 81 1551
268 16 1552
557 342 1553
251 666 1554
331 618 1555
205 195 1556
374 1037 1557
466 267 1558
184 23 1559
118 105 1560
294 198 1561
189 199 1562
178 9 1563
170 231 1564
178 616 1565
174 307 1566
54 657 1567
314 502 1568
36 211 1569
190 288 1570
284 29 1571
463 6 1572
10 186 1573
347 417 1574
1073 333 1575
176 183 1576
35 179 1577
873 29 1578
177 197 1579
266 18 1580
495 31 1581
144 74 1582
9 207 1583
268 6 1584
30 285 1585
605 285 1586
188 581 1587
202 31 1588
10 209 1589
9 285 1590
4 115 1591
350 13 1592
443 83 1593
269 535 1594
257 12 1595
254 6 1596
243 18 1597
21 9 1598
178 15 1599
597 29 1600
925 311 1601
182 29 1602
4 131 1603
57 43 1604
1039 12 1605
344 831 1606
28 348 1607
188 237 1608
181 14 1609
547 600 1610
182 13 1611
476 177 1612
251 1392 1613
33 979 1614
191 11 1615
193 7 1616
194 29 1617
214 272 1618
243 228 1619
194 12 1620
558 198 1621
240 207 1622
28 336 1623
270 209 1624
58 58 1625
195 26 1626
63 73 1627
225 192 1628
205 16 1629
30 237 1630
1575 665 1631
361 255 1632
11 271 1633
1486 171 1634
314 186 1635
249 189 1636
738 61 1637
680 34 1638
286 8 1639
630 31 1640
607 346 1641
461 293 1642
755 381 1643
24 6 1644
299 631 1645
21 31 1646
271 210 1647
171 181 1648
63 97 1649
36 346 1650
803 19 1651
15 197 1652
531 507 1653
296 61 1654
362 5 1655
17 175 1656
399 271 1657
313 257 1658
212 372 1659
787 198 1660
174 694 1661
191 18 1662
205 181 1663
212 302 1664
13 228 1665
176 502 1666
189 15 1667
338 206 1668
25 186 1669
241 203 1670
27 207 1671
772 239 1672
182 341 1673
33 370 1674
8 192 1675
4 368 1676
33 360 1677
386 202 1678
4 66 1679
763 89 1680
275 208 1681
246 15 1682
94 93 1683
197 29 1684
168 226 1685
175 26 1686
278 8 1687
323 260 1688
19 183 1689
208 401 1690
187 293 1691
296 91 1692
218 181 1693
177 1121 1694
25 189 1695
235 27 1696
193 24 1697
229 507 1698
172 536 1699
295 17 1700
313 293 1701
595 6 1702
168 189 1703
363 198 1704
249 282 1705
36 370 1706
315 31 1707
4 145 1708
188 341 1709
202 221 1710
9 279 1711
382 210 1712
54 77 1713
4 146 1714
446 10 1715
254 8 1716
249 26 1717
220 13 1718
33 462 1719
358 9 1720
251 17 1721
14 213 1722
319 8 1723
185 16 1724
772 204 1725
630 16 1726
1109 14 1727
228 221 1728
419 304 1729
31 175 1730
364 935 1731
245 471 1732
251 171 1733
219 29 1734
326 28 1735
414 34 1736
344 197 1737
314 356 1738
4 388 1739
28 5 1740
675 26 1741
344 198 1742
192 304 1743
295 9 1744
1028 226 1745
170 193 1746
34 210 1747
795 1436 1748
191 471 1749
576 6 1750
367 287 1751
262 198 1752
19 288 1753
1319 31 1754
188 1700 1755
1182 247 1756
187 356 1757
28 171 1758
223 12 1759
373 18 1760
187 21 1761
871 62 1762
229 241 1763
212 805 1764
292 633 1765
756 913 1766
250 17 1767
9 384 1768
284 14 1769
233 26 1770
175 260 1771
314 279 1772
271 11 1773
194 15 1774
259 171 1775
1356 24 1776
358 507 1777
1011 210 1778
196 178 1779
178 10 1780
568 622 1781
244 189 1782
14 606 1783
14 356 1784
172 25 1785
31 1097 1786
174 598 1787
254 186 1788
1021 198 1789
172 173 1790
319 6 1791
212 303 1792
283 8 1793
1625 98 1794
8 198 1795
4 301 1796
296 50 1797
223 10 1798
181 16 1799
313 336 1800
208 228 1801
220 305 1802
4 137 1803
217 35 1804
896 768 1805
47 43 1806
281 12 1807
353 192 1808
413 14 1809
168 405 1810
188 178 1811
578 228 1812
168 789 1813
547 529 1814
524 13 1815
314 285 1816
561 293 1817
326 17 1818
258 1232 1819
1164 477 1820
173 298 1821
172 237 1822
9 15 1823
246 197 1824
212 523 1825
361 221 1826
39 45 1827
1277 121 1828
247 16 1829
302 194 1830
199 807 1831
942 31 1832
1169 219 1833
691 262 1834
174 237 1835
296 90 1836
406 175 1837
557 11 1838
219 6 1839
30 5 1840
265 27 1841
28 311 1842
323 6 1843
394 208 1844
276 10 1845
257 9 1846
469 16 1847
245 383 1848
399 177 1849
377 6 1850
241 178 1851
226 198 1852
17 226 1853
273 175 1854
19 320 1855
390 199 1856
489 197 1857
1198 1794 1858
245 974 1859
313 348 1860
174 913 1861
223 16 1862
270 668 1863
184 249 1864
352 6 1865
205 26 1866
315 6 1867
391 412 1868
258 21 1869
184 635 1870
1221 736 1871
461 311 1872
178 442 1873
301 29 1874
465 276 1875
603 281 1876
4 143 1877
168 249 1878
247 14 1879
168 341 1880
655 1441 1881
30 279 1882
308 226 1883
14 864 1884
4 29 1885
219 9 1886
174 173 1887
254 178 1888
175 221 1889
431 13 1890
245 10 1891
200 342 1892
781 216 1893
258 300 1894
1089 255 1895
467 13 1896
776 248 1897
195 659 1898
344 590 1899
174 854 1900
369 11 1901
174 585 1902
537 215 1903
794 36 1904
590 14 1905
28 404 1906
1749 459 1907
287 435 1908
661 193 1909
39 43 1910
394 176 1911
252 287 1912
11 46 1913
625 183 1914
205 241 1915
269 391 1916
1582 1368 1917
184 303 1918
491 7 1919
996 74 1920
376 183 1921
142 1917 1922
256 17 1923
416 6 1924
195 462 1925
39 44 1926
168 202 1927
178 237 1928
168 669 1929
182 732 1930
4 122 1931
257 198 1932
63 77 1933
418 206 1934
411 17 1935
1643 29 1936
208 831 1937
1241 198 1938
820 836 1939
527 330 1940
280 6 1941
610 828 1942
207 15 1943
212 177 1944
436 11 1945
854 34 1946
473 23 1947
489 818 1948
850 17 1949
690 10 1950
167 313 1951
1541 730 1952
220 417 1953
4 77 1954
4 12 1955
436 444 1956
60 77 1957
189 21 1958
313 324 1959
259 449 1960
1099 11 1961
14 664 1962
249 12 1963
737 178 1964
1696 766 1965
240 186 1966
296 83 1967
174 805 1968
968 107 1969
68 133 1970
200 944 1971
182 175 1972
276 255 1973
367 542 1974
251 1461 1975
975 12 1976
240 288 1977
241 15 1978
205 25 1979
186 14 1980
390 198 1981
1375 280 1982
321 8 1983
194 198 1984
1324 195 1985
809 12 1986
884 10 1987
21 653 1988
513 1801 1989
1682 740 1990
536 585 1991
205 337 1992
195 198 1993
17 279 1994
182 210 1995
259 175 1996
226 9 1997
739 14 1998
4 149 1999
287 9 2000
170 239 2001
194 9 2002
212 315 2003
520 16 2004
225 207 2005
63 109 2006
252 16 2007
219 198 2008
934 796 2009
335 26 2010
1189 526 2011
651 74 2012
278 21 2013
473 7 2014
240 8 2015
175 31 2016
347 260 2017
1325 375 2018
294 10 2019
17 178 2020
313 311 2021
269 29 2022
235 219 2023
177 203 2024
294 193 2025
773 27 2026
1188 301 2027
353 7 2028
205 28 2029
188 1090 2030
577 16 2031
21 221 2032
506 282 2033
367 206 2034
756 385 2035
176 216 2036
269 175 2037
242 16 2038
445 849 2039
911 63 2040
182 1123 2041
190 551 2042
4 1680 2043
1179 232 2044
54 58 2045
1228 677 2046
63 1069 2047
634 173 2048
205 341 2049
212 210 2050
11 256 2051
552 6 2052
1735 396 2053
197 226 2054
431 198 2055
203 13 2056
168 1212 2057
510 485 2058
14 593 2059
186 6 2060
304 9 2061
187 1658 2062
219 12 2063
191 295 2064
73 60 2065
568 395 2066
245 686 2067
274 16 2068
419 26 2069
328 11 2070
1523 177 2071
228 21 2072
427 175 2073
182 581 2074
220 697 2075
252 1026 2076
233 668 2077
650 30 2078
609 401 2079
175 12 2080
353 6 2081
174 330 2082
191 46 2083
1762 785 2084
239 189 2085
286 248 2086
31 6 2087
4 108 2088
397 12 2089
360 6 2090
229 223 2091
5 231 2092
274 203 2093
2012 2084 2094
397 887 2095
182 256 2096
26 24 2097
11 179 2098
65 47 2099
1257 1677 2100
212 1183 2101
465 175 2102
172 34 2103
706 16 2104
560 742 2105
496 280 2106
532 384 2107
465 964 2108
60 95 2109
15 10 2110
245 521 2111
68 45 2112
15 178 2113
338 199 2114
191 305 2115
1013 10 2116
31 203 2117
577 181 2118
326 481 2119
367 28 2120
1063 17 2121
1020 6 2122
4 318 2123
294 21 2124
299 221 2125
352 31 2126
445 177 2127
194 282 2128
443 85 2129
304 221 2130
350 272 2131
335 1989 2132
767 438 2133
917 194 2134
253 521 2135
1086 768 2136
262 10 2137
34 998 2138
182 16 2139
8 31 2140
253 459 2141
104 93 2142
576 21 2143
905 58 2144
197 15 2145
282 350 2146
222 14 2147
4 130 2148
11 303 2149
4 150 2150
1419 208 2151
232 371 2152
4 151 2153
168 1490 2154
211 7 2155
244 249 2156
347 1418 2157
468 208 2158
569 199 2159
30 211 2160
188 267 2161
237 371 2162
213 25 2163
565 333 2164
172 17 2165
435 24 2166
6 208 2167
327 8 2168
4 746 2169
54 89 2170
582 339 2171
506 284 2172
202 16 2173
243 177 2174
9 209 2175
266 420 2176
195 12 2177
1314 23 2178
876 242 2179
5 217 2180
443 80 2181
4 183 2182
269 508 2183
364 1412 2184
223 173 2185
28 279 2186
296 80 2187
242 10 2188
506 298 2189
1287 16 2190
37 43 2191
35 300 2192
167 21 2193
411 564 2194
200 1140 2195
338 213 2196
199 175 2197
489 1065 2198
34 990 2199
9 346 2200
168 1251 2201
254 248 2202
170 989 2203
205 267 2204
406 989 2205
1158 724 2206
59 95 2207
837 435 2208
1703 1719 2209
308 189 2210
273 11 2211
612 19 2212
200 197 2213
827 319 2214
168 231 2215
235 11 2216
1020 29 2217
226 189 2218
175 208 2219
338 12 2220
191 728 2221
557 509 2222
207 18 2223
691 368 2224
448 438 2225
1628 223 2226
212 21 2227
101 101 2228
222 572 2229
235 384 2230
13 16 2231
167 736 2232
188 1323 2233
15 183 2234
332 324 2235
1098 2228 2236
767 189 2237
15 573 2238
182 302 2239
174 171 2240
431 828 2241
218 197 2242
625 285 2243
38 10 2244
377 31 2245
312 197 2246
1603 2040 2247
258 13 2248
212 226 2249
200 6 2250
350 7 2251
200 5 2252
194 5 2253
9 324 2254
209 221 2255
28 403 2256
205 521 2257
239 359 2258
270 757 2259
182 178 2260
536 16 2261
171 417 2262
205 368 2263
268 9 2264
758 586 2265
235 817 2266
274 189 2267
514 210 2268
367 176 2269
1383 1482 2270
578 352 2271
184 175 2272
516 320 2273
844 178 2274
188 268 2275
191 1937 2276
768 101 2277
755 375 2278
233 16 2279
232 29 2280
182 177 2281
965 2144 2282
373 5 2283
278 202 2284
284 16 2285
1175 391 2286
194 10 2287
258 608 2288
2282 2277 2289
270 853 2290
255 754 2291
188 256 2292
270 705 2293
737 366 2294
198 34 2295
867 860 2296
364 1216 2297
28 389 2298
60 60 2299
402 17 2300
233 730 2301
942 6 2302
443 90 2303
453 6 2304
2013 295 2305
1481 176 2306
362 420 2307
168 447 2308
170 2166 2309
406 239 2310
35 211 2311
612 330 2312
555 257 2313
174 1579 2314
14 256 2315
253 317 2316
63 89 2317
690 12 2318
281 198 2319
692 303 2320
189 10 2321
194 171 2322
332 508 2323
1048 228 2324
569 1056 2325
411 237 2326
25 183 2327
1949 384 2328
235 499 2329
217 766 2330
200 199 2331
246 179 2332
1077 1263 2333
175 27 2334
292 319 2335
11 293 2336
191 1072 2337
246 284 2338
173 221 2339
561 324 2340
220 9 2341
253 9 2342
60 657 2343
295 519 2344
186 26 2345
280 17 2346
533 1895 2347
690 198 2348
192 9 2349
188 786 2350
239 498 2351
1521 946 2352
33 211 2353
464 26 2354
243 330 2355
317 221 2356
270 729 2357
277 305 2358
168 523 2359
188 1694 2360
275 305 2361
237 248 2362
269 15 2363
236 1583 2364
1057 12 2365
269 371 2366
747 2180 2367
316 304 2368
225 1913 2369
601 381 2370
475 198 2371
2023 199 2372
1034 204 2373
497 10 2374
330 17 2375
220 29 2376
1443 204 2377
1861 360 2378
253 26 2379
221 13 2380
388 221 2381
445 193 2382
43 51 2383
386 211 2384
252 27 2385
207 23 2386
503 26 2387
33 389 2388
822 300 2389
185 198 2390
65 57 2391
1351 57 2392
2094 1432 2393
728 522 2394
561 311 2395
1156 282 2396
326 38 2397
167 281 2398
1115 2065 2399
212 260 2400
170 904 2401
188 666 2402
961 391 2403
410 730 2404
25 216 2405
8 189 2406
619 179 2407
187 682 2408
275 14 2409
257 6 2410
443 61 2411
1114 221 2412
208 21 2413
257 15 2414
272 29 2415
369 586 2416
27 226 2417
710 475 2418
1177 26 2419
443 91 2420
171 9 2421
400 8 2422
244 1076 2423
205 434 2424
501 228 2425
14 786 2426
409 179 2427
233 328 2428
65 39 2429
182 376 2430
205 302 2431
1227 60 2432
106 43 2433
1278 226 2434
364 477 2435
281 260 2436
578 350 2437
197 319 2438
194 202 2439
1310 219 2440
174 181 2441
1108 623 2442
722 221 2443
338 21 2444
316 21 2445
1483 383 2446
269 1042 2447
59 73 2448
625 313 2449
245 372 2450
850 24 2451
1048 10 2452
755 241 2453
409 360 2454
651 115 2455
231 14 2456
607 370 2457
975 534 2458
188 776 2459
261 13 2460
844 499 2461
1409 241 2462
948 242 2463
174 1804 2464
171 175 2465
33 534 2466
229 2106 2467
218 11 2468
242 210 2469
138 59 2470
1655 171 2471
331 964 2472
192 17 2473
30 707 2474
1032 202 2475
713 208 2476
483 970 2477
1012 564 2478
270 29 2479
315 16 2480
588 208 2481
27 186 2482
182 1389 2483
216 17 2484
176 189 2485
287 219 2486
46 482 2487
466 269 2488
199 260 2489
445 660 2490
566 221 2491
269 838 2492
531 199 2493
406 186 2494
603 29 2495
949 302 2496
59 89 2497
212 1962 2498
214 289 2499
294 375 2500
203 734 2501
188 216 2502
353 237 2503
453 7 2504
443 81 2505
184 199 2506
195 840 2507
169 23 2508
27 194 2509
178 412 2510
908 21 2511
405 29 2512
332 293 2513
422 1296 2514
427 8 2515
374 13 2516
212 540 2517
1081 1567 2518
13 46 2519
243 765 2520
353 207 2521
4 141 2522
1458 1050 2523
198 21 2524
577 6 2525
2455 117 2526
313 450 2527
619 1195 2528
518 219 2529
219 355 2530
476 228 2531
10 285 2532
168 1747 2533
399 385 2534
18 29 2535
245 301 2536
6 223 2537
443 50 2538
1084 2322 2539
468 13 2540
603 11 2541
30 293 2542
565 215 2543
713 400 2544
192 21 2545
191 302 2546
394 807 2547
988 24 2548
1445 1534 2549
25 300 2550
12 209 2551
253 181 2552
1120 1410 2553
499 1301 2554
239 870 2555
217 29 2556
1284 210 2557
169 563 2558
9 370 2559
253 522 2560
307 15 2561
472 232 2562
310 29 2563
893 193 2564
352 16 2565
195 271 2566
746 109 2567
243 2392 2568
199 297 2569
588 25 2570
191 249 2571
487 1600 2572
692 231 2573
9 293 2574
2397 677 2575
405 33 2576
419 425 2577
208 513 2578
416 793 2579
12 707 2580
188 8 2581
15 281 2582
213 14 2583
168 271 2584
284 178 2585
1538 183 2586
182 741 2587
210 454 2588
251 381 2589
205 579 2590
255 31 2591
308 5 2592
252 282 2593
250 27 2594
189 202 2595
223 202 2596
1420 178 2597
212 922 2598
394 2251 2599
347 388 2600
410 175 2601
27 173 2602
301 300 2603
692 195 2604
4 148 2605
374 255 2606
168 288 2607
251 474 2608
717 17 2609
1907 247 2610
410 216 2611
172 282 2612
294 29 2613
269 1159 2614
764 346 2615
2299 125 2616
461 239 2617
210 193 2618
182 542 2619
799 14 2620
205 618 2621
235 1134 2622
1558 1690 2623
1532 73 2624
1475 281 2625
1302 177 2626
233 729 2627
4 152 2628
30 209 2629
223 8 2630
245 2446 2631
809 198 2632
118 104 2633
357 256 2634
398 2417 2635
466 1773 2636
191 337 2637
178 11 2638
654 55 2639
577 29 2640
60 74 2641
187 354 2642
170 1753 2643
931 189 2644
400 956 2645
9 185 2646
543 21 2647
183 23 2648
378 15 2649
399 969 2650
182 790 2651
401 13 2652
243 10 2653
195 384 2654
1306 183 2655
205 17 2656
2333 2470 2657
549 29 2658
476 5 2659
394 16 2660
186 10 2661
386 784 2662
1278 14 2663
1043 2343 2664
416 18 2665
555 30 2666
190 213 2667
97 86 2668
1118 260 2669
619 383 2670
182 330 2671
62 54 2672
223 189 2673
221 175 2674
1138 1511 2675
258 721 2676
188 29 2677
218 189 2678
387 241 2679
48 449 2680
212 328 2681
1790 339 2682
234 43 2683
188 1360 2684
251 586 2685
416 7 2686
187 25 2687
369 401 2688
427 203 2689
184 1271 2690
168 103 2691
447 747 2692
303 21 2693
1039 192 2694
917 855 2695
304 198 2696
469 268 2697
9 336 2698
14 179 2699
374 198 2700
182 199 2701
448 16 2702
1770 593 2703
1606 29 2704
342 10 2705
243 2433 2706
59 109 2707
17 285 2708
254 682 2709
518 198 2710
521 177 2711
247 12 2712
638 2253 2713
280 15 2714
469 280 2715
191 1126 2716
228 13 2717
182 1905 2718
911 87 2719
218 305 2720
182 8 2721
170 574 2722
431 175 2723
10 313 2724
332 336 2725
184 682 2726
329 216 2727
2178 186 2728
218 194 2729
196 723 2730
228 16 2731
335 27 2732
182 19 2733
25 197 2734
212 904 2735
188 982 2736
228 15 2737
168 1514 2738
205 522 2739
169 1406 2740
365 81 2741
1478 1095 2742
241 434 2743
631 175 2744
2408 6 2745
2274 597 2746
1468 12 2747
1631 13 2748
253 257 2749
1214 176 2750
233 343 2751
406 195 2752
235 21 2753
51 44 2754
11 389 2755
353 18 2756
205 664 2757
1253 11 2758
476 18 2759
184 1248 2760
415 490 2761
228 31 2762
1237 2550 2763
948 492 2764
63 95 2765
1830 1187 2766
263 12 2767
932 801 2768
795 2624 2769
394 12 2770
177 2339 2771
14 189 2772
17 203 2773
1149 29 2774
200 18 2775
2203 874 2776
19 189 2777
6 1102 2778
253 17 2779
319 31 2780
1092 19 2781
1150 12 2782
251 320 2783
273 761 2784
399 663 2785
494 179 2786
252 433 2787
1073 256 2788
207 1896 2789
273 601 2790
345 271 2791
212 242 2792
173 305 2793
308 18 2794
394 377 2795
1180 34 2796
212 15 2797
248 13 2798
252 1831 2799
246 381 2800
202 269 2801
174 268 2802
245 16 2803
725 7 2804
377 16 2805
895 194 2806
97 58 2807
357 1444 2808
184 641 2809
291 1269 2810
703 228 2811
406 178 2812
447 490 2813
249 29 2814
68 44 2815
25 179 2816
14 1125 2817
59 87 2818
2687 435 2819
197 307 2820
1930 21 2821
236 658 2822
518 298 2823
240 6 2824
214 434 2825
371 206 2826
17 177 2827
34 1244 2828
254 477 2829
410 16 2830
1737 17 2831
252 1275 2832
274 75 2833
459 198 2834
174 1487 2835
308 249 2836
333 221 2837
182 171 2838
652 2054 2839
1709 450 2840
244 175 2841
13 17 2842
368 29 2843
16 392 2844
262 16 2845
298 21 2846
235 1666 2847
1856 10 2848
255 21 2849
4 118 2850
2488 26 2851
1443 202 2852
262 192 2853
74 66 2854
254 320 2855
182 1573 2856
332 391 2857
295 198 2858
1107 281 2859
12 185 2860
291 18 2861
2518 2719 2862
378 1093 2863
250 14 2864
251 282 2865
738 55 2866
205 586 2867
210 21 2868
257 199 2869
362 18 2870
45 45 2871
182 14 2872
170 2573 2873
240 44 2874
1024 1090 2875
188 864 2876
195 9 2877
378 255 2878
33 396 2879
328 198 2880
822 8 2881
1011 237 2882
226 17 2883
1126 24 2884
759 183 2885
466 587 2886
196 502 2887
326 185 2888
223 217 2889
345 208 2890
996 54 2891
4 109 2892
1136 282 2893
6 572 2894
283 211 2895
188 221 2896
620 33 2897
1214 282 2898
1024 257 2899
415 1437 2900
1968 294 2901
1544 130 2902
182 1366 2903
1378 12 2904
214 189 2905
417 6 2906
253 608 2907
402 241 2908
409 21 2909
642 467 2910
2902 117 2911
182 579 2912
283 1129 2913
1506 2485 2914
243 171 2915
255 202 2916
12 845 2917
232 189 2918
1681 271 2919
206 10 2920
182 319 2921
17 209 2922
1596 178 2923
2041 183 2924
1847 183 2925
595 16 2926
561 348 2927
541 13 2928
2069 829 2929
223 21 2930
221 195 2931
253 747 2932
536 195 2933
275 186 2934
241 13 2935
240 789 2936
332 348 2937
210 9 2938
1293 294 2939
1041 10 2940
332 311 2941
244 1647 2942
576 8 2943
1499 247 2944
176 285 2945
233 788 2946
720 241 2947
473 336 2948
302 21 2949
374 304 2950
278 18 2951
33 385 2952
28 500 2953
34 1312 2954
391 442 2955
2633 114 2956
170 1928 2957
1137 177 2958
30 336 2959
313 404 2960
256 210 2961
1870 177 2962
314 216 2963
245 1923 2964
63 763 2965
406 1520 2966
184 1980 2967
13 346 2968
473 293 2969
1912 2262 2970
1007 19 2971
182 818 2972
175 16 2973
1929 268 2974
168 179 2975
394 192 2976
212 267 2977
1170 26 2978
327 44 2979
253 2466 2980
36 396 2981
21 16 2982
2165 219 2983
316 6 2984
431 9 2985
10 185 2986
202 17 2987
312 15 2988
1809 178 2989
243 383 2990
1249 210 2991
167 219 2992
268 12 2993
914 213 2994
415 267 2995
182 429 2996
292 199 2997
323 396 2998
28 375 2999
728 21 3000
168 377 3001
405 6 3002
30 324 3003
341 1549 3004
246 600 3005
283 18 3006
459 12 3007
1712 173 3008
1529 341 3009
236 2771 3010
644 769 3011
214 303 3012
30 348 3013
345 1369 3014
888 34 3015
205 287 3016
330 9 3017
365 50 3018
193 23 3019
16 206 3020
607 179 3021
401 14 3022
274 616 3023
588 304 3024
722 31 3025
174 1530 3026
445 198 3027
26 255 3028
30 24 3029
1414 457 3030
168 303 3031
12 271 3032
770 14 3033
429 922 3034
620 204 3035
344 2366 3036
182 946 3037
1384 19 3038
323 46 3039
244 388 3040
1343 350 3041
292 2231 3042
273 280 3043
181 29 3044
552 502 3045
461 759 3046
369 513 3047
226 192 3048
1394 789 3049
259 178 3050
241 208 3051
4 1922 3052
1295 223 3053
188 1166 3054
350 175 3055
30 845 3056
252 271 3057
8 202 3058
365 61 3059
266 2244 3060
228 29 3061
368 193 3062
210 16 3063
312 192 3064
174 262 3065
274 181 3066
526 282 3067
11 12 3068
174 446 3069
1555 11 3070
1945 208 3071
681 173 3072
914 297 3073
182 249 3074
859 23 3075
764 370 3076
286 30 3077
506 936 3078
466 904 3079
182 181 3080
501 7 3081
495 16 3082
322 947 3083
210 221 3084
323 211 3085
28 385 3086
273 26 3087
188 2394 3088
243 538 3089
1107 33 3090
174 2185 3091
266 392 3092
235 1015 3093
469 1387 3094
258 34 3095
1317 15 3096
365 91 3097
466 15 3098
313 403 3099
423 618 3100
489 267 3101
712 284 3102
214 211 3103
212 11 3104
176 194 3105
294 221 3106
221 9 3107
735 85 3108
304 31 3109
174 579 3110
422 563 3111
1480 1068 3112
1032 204 3113
1107 1413 3114
188 521 3115
37 44 3116
29 206 3117
1122 12 3118
243 551 3119
26 16 3120
1209 2789 3121
307 297 3122
203 1083 3123
357 185 3124
304 21 3125
489 921 3126
68 43 3127
248 198 3128
223 192 3129
182 209 3130
678 186 3131
245 287 3132
335 428 3133
416 207 3134
182 213 3135
211 206 3136
511 1502 3137
332 403 3138
175 10 3139
465 570 3140
413 318 3141
201 1145 3142
918 400 3143
240 486 3144
835 2427 3145
7 10 3146
54 87 3147
411 583 3148
257 11 3149
2553 774 3150
473 348 3151
252 302 3152
569 1433 3153
245 429 3154
235 210 3155
883 81 3156
487 597 3157
664 208 3158
331 30 3159
36 183 3160
245 1730 3161
218 2334 3162
1393 836 3163
33 183 3164
188 955 3165
510 262 3166
177 305 3167
237 14 3168
1219 11 3169
531 14 3170
335 189 3171
182 860 3172
4 119 3173
532 388 3174
30 271 3175
2048 779 3176
617 12 3177
218 221 3178
1280 1791 3179
182 813 3180
26 211 3181
645 328 3182
858 6 3183
1348 556 3184
660 206 3185
245 433 3186
397 366 3187
1306 279 3188
445 257 3189
253 1715 3190
230 27 3191
1372 12 3192
1828 94 3193
194 551 3194
219 8 3195
1027 9 3196
188 1855 3197
343 189 3198
413 298 3199
235 2261 3200
25 207 3201
15 11 3202
8 247 3203
461 480 3204
327 34 3205
222 2773 3206
2074 774 3207
1132 10 3208
258 26 3209
468 31 3210
253 178 3211
2950 400 3212
869 875 3213
737 2060 3214
190 183 3215
914 189 3216
261 9 3217
245 921 3218
3060 2295 3219
1140 319 3220
260 16 3221
194 34 3222
2035 173 3223
1424 417 3224
873 16 3225
168 195 3226
1093 8 3227
1165 206 3228
73 54 3229
5 216 3230
233 853 3231
13 177 3232
167 857 3233
197 203 3234
405 16 3235
4 54 3236
173 281 3237
344 1096 3238
353 194 3239
243 211 3240
2001 754 3241
343 12 3242
304 193 3243
447 600 3244
209 9 3245
212 16 3246
174 1410 3247
543 227 3248
220 1200 3249
263 208 3250
331 1630 3251
603 307 3252
2342 301 3253
365 83 3254
2656 593 3255
350 34 3256
338 185 3257
246 586 3258
655 679 3259
250 2766 3260
184 178 3261
331 276 3262
533 2146 3263
307 9 3264
47 44 3265
837 2489 3266
848 583 3267
368 21 3268
328 12 3269
973 219 3270
332 450 3271
170 1626 3272
405 31 3273
251 289 3274
393 2019 3275
255 219 3276
14 933 3277
867 376 3278
588 194 3279
268 198 3280
217 12 3281
170 295 3282
9 46 3283
711 16 3284
269 1344 3285
214 297 3286
182 271 3287
2642 280 3288
245 1065 3289
398 497 3290
308 186 3291
1556 1758 3292
190 194 3293
1404 31 3294
270 9 3295
886 226 3296
1891 2484 3297
1403 384 3298
1732 315 3299
171 6 3300
1764 257 3301
247 6 3302
1168 34 3303
229 9 3304
1983 2367 3305
373 227 3306
357 269 3307
326 677 3308
225 183 3309
1975 10 3310
397 189 3311
1342 29 3312
406 247 3313
243 289 3314
422 1396 3315
1564 33 3316
184 183 3317
1560 105 3318
338 14 3319
201 792 3320
365 80 3321
54 101 3322
501 352 3323
309 221 3324
19 173 3325
212 1123 3326
246 178 3327
65 49 3328
1688 17 3329
222 223 3330
212 181 3331
65 51 3332
10 324 3333
2726 25 3334
182 248 3335
188 1076 3336
291 1040 3337
186 35 3338
398 1323 3339
492 193 3340
1049 10 3341
185 13 3342
243 192 3343
552 8 3344
2313 534 3345
2355 2436 3346
263 37 3347
2716 984 3348
298 6 3349
286 216 3350
63 119 3351
492 359 3352
258 202 3353
10 293 3354
195 663 3355
2751 769 3356
1405 482 3357
1184 354 3358
473 324 3359
975 192 3360
569 203 3361
235 26 3362
212 199 3363
65 132 3364
2864 425 3365
274 31 3366
394 289 3367
1346 12 3368
1457 8 3369
399 27 3370
530 922 3371
652 1251 3372
441 2658 3373
413 305 3374
205 269 3375
367 223 3376
1761 25 3377
9 484 3378
272 14 3379
168 305 3380
812 198 3381
896 60 3382
713 2820 3383
905 2047 3384
218 213 3385
170 2037 3386
713 425 3387
329 103 3388
62 74 3389
263 14 3390
172 2801 3391
199 15 3392
216 193 3393
2128 551 3394
1043 816 3395
506 11 3396
357 315 3397
2142 122 3398
273 686 3399
305 34 3400
210 457 3401
1333 1213 3402
1927 1335 3403
25 279 3404
533 732 3405
178 19 3406
2079 1134 3407
458 395 3408
329 181 3409
378 352 3410
257 29 3411
506 333 3412
19 285 3413
46 26 3414
6 203 3415
1235 34 3416
65 53 3417
483 178 3418
466 447 3419
1149 16 3420
202 9 3421
253 540 3422
262 189 3423
9 375 3424
363 193 3425
703 402 3426
183 18 3427
571 10 3428
188 579 3429
561 336 3430
205 203 3431
260 175 3432
29 17 3433
39 51 3434
186 438 3435
196 509 3436
1008 284 3437
2651 2535 3438
2337 249 3439
612 305 3440
2010 177 3441
723 34 3442
561 403 3443
1560 112 3444
770 173 3445
172 260 3446
1105 281 3447
217 215 3448
651 3444 3449
3398 1683 3450
3449 3450 3451
3205 3416 3452
212 341 3453
491 194 3454
179 18 3455
427 213 3456
9 396 3457
185 3227 3458
329 178 3459
1021 219 3460
194 192 3461
717 210 3462
222 542 3463
411 1272 3464
715 8 3465
195 389 3466
170 287 3467
1061 25 3468
235 199 3469
4 313 3470
496 21 3471
331 1112 3472
1481 940 3473
235 276 3474
94 94 3475
247 9 3476
168 486 3477
619 1454 3478
233 2447 3479
596 653 3480
114 141 3481
812 260 3482
465 213 3483
551 228 3484
961 661 3485
10 341 3486
308 302 3487
16 300 3488
187 288 3489
1934 28 3490
244 1715 3491
4 114 3492
200 1590 3493
57 45 3494
1078 749 3495
7 219 3496
272 16 3497
2546 35 3498
243 217 3499
1924 474 3500
12 839 3501
27 288 3502
526 298 3503
103 21 3504
408 219 3505
247 15 3506
2451 717 3507
251 186 3508
245 9 3509
2987 213 3510
1347 193 3511
299 705 3512
1063 602 3513
416 8 3514
828 28 3515
212 17 3516
387 341 3517
207 455 3518
578 1185 3519
168 849 3520
9 271 3521
188 284 3522
2931 778 3523
186 11 3524
937 2884 3525
1915 1408 3526
1124 381 3527
169 279 3528
2594 3122 3529
549 8 3530
238 667 3531
369 197 3532
202 28 3533
917 1131 3534
820 1675 3535
1141 8 3536
168 1298 3537
353 517 3538
821 208 3539
3347 1407 3540
654 81 3541
488 11 3542
226 294 3543
316 674 3544
184 723 3545
1385 450 3546
596 26 3547
228 193 3548
3217 203 3549
205 178 3550
239 197 3551
459 189 3552
27 271 3553
203 1382 3554
226 195 3555
191 13 3556
292 742 3557
172 452 3558
205 176 3559
261 507 3560
795 3318 3561
269 899 3562
11 183 3563
253 3510 3564
26 207 3565
3561 1683 3566
228 315 3567
15 434 3568
1453 723 3569
19 279 3570
1678 849 3571
1556 3004 3572
182 2919 3573
1824 554 3574
961 508 3575
908 29 3576
14 783 3577
247 181 3578
1217 1862 3579
253 372 3580
349 1224 3581
394 564 3582
362 502 3583
397 208 3584
1237 671 3585
31 502 3586
74 77 3587
168 35 3588
278 1569 3589
578 217 3590
1881 29 3591
378 2162 3592
433 221 3593
773 26 3594
265 208 3595
11 328 3596
273 21 3597
331 2645 3598
1061 319 3599
39 136 3600
414 396 3601
235 1305 3602
1259 810 3603
3144 210 3604
281 208 3605
1343 217 3606
897 1305 3607
352 221 3608
5 26 3609
4 871 3610
308 216 3611
265 13 3612
195 35 3613
246 2315 3614
809 192 3615
344 2999 3616
2979 1351 3617
182 400 3618
205 776 3619
560 509 3620
794 633 3621
1260 583 3622
2558 226 3623
25 573 3624
356 14 3625
70 44 3626
272 31 3627
33 193 3628
9 223 3629
184 21 3630
316 1224 3631
719 6 3632
1358 298 3633
560 877 3634
257 192 3635
335 808 3636
374 21 3637
267 14 3638
435 2454 3639
464 12 3640
362 6 3641
360 282 3642
394 31 3643
191 210 3644
1668 198 3645
195 10 3646
530 1183 3647
182 523 3648
243 213 3649
184 1203 3650
1519 248 3651
532 986 3652
182 9 3653
250 19 3654
19 377 3655
12 192 3656
19 248 3657
28 46 3658
196 34 3659
2193 219 3660
268 202 3661
402 1670 3662
74 111 3663
189 8 3664
205 171 3665
272 6 3666
303 198 3667
1006 381 3668
273 485 3669
17 324 3670
59 97 3671
5 195 3672
265 572 3673
45 64 3674
360 298 3675
9 348 3676
289 34 3677
258 6 3678
1002 1055 3679
735 1264 3680
174 267 3681
221 754 3682
2412 8 3683
1474 255 3684
11 34 3685
240 175 3686
382 262 3687
170 341 3688
223 29 3689
250 694 3690
182 384 3691
365 90 3692
1192 25 3693
942 16 3694
532 48 3695
262 9 3696
178 305 3697
390 14 3698
247 13 3699
423 232 3700
518 747 3701
182 295 3702
343 198 3703
63 62 3704
1394 3435 3705
2722 791 3706
367 12 3707
174 1181 3708
178 1988 3709
241 27 3710
2226 2380 3711
1028 550 3712
210 320 3713
316 29 3714
312 5 3715
2921 27 3716
235 33 3717
557 203 3718
331 241 3719
1352 298 3720
182 1973 3721
4 132 3722
400 12 3723
184 189 3724
252 30 3725
1383 171 3726
2070 183 3727
212 818 3728
524 29 3729
582 10 3730
244 381 3731
778 8 3732
662 372 3733
232 391 3734
617 383 3735
591 223 3736
12 889 3737
4 147 3738
11 207 3739
1148 858 3740
337 208 3741
182 447 3742
225 171 3743
292 791 3744
332 404 3745
174 860 3746
1027 202 3747
263 31 3748
651 111 3749
976 221 3750
200 8 3751
38 9 3752
244 210 3753
182 880 3754
258 186 3755
259 194 3756
167 285 3757
233 777 3758
292 257 3759
1572 206 3760
1114 613 3761
197 9 3762
873 181 3763
15 193 3764
1539 206 3765
15 189 3766
365 85 3767
1280 2780 3768
178 1102 3769
12 912 3770
1372 198 3771
2508 231 3772
427 1097 3773
303 10 3774
77 89 3775
624 810 3776
1001 2616 3777
453 8 3778
292 943 3779
598 282 3780
469 363 3781
11 2692 3782
560 943 3783
962 593 3784
2139 888 3785
30 403 3786
15 248 3787
328 554 3788
1661 564 3789
304 16 3790
200 2743 3791
411 695 3792
292 21 3793
1056 507 3794
988 300 3795
294 176 3796
2398 242 3797
2202 497 3798
1130 219 3799
492 198 3800
451 18 3801
174 2585 3802
200 1943 3803
199 12 3804
343 208 3805
1118 343 3806
1144 223 3807
1902 301 3808
1664 294 3809
212 694 3810
458 221 3811
25 185 3812
2453 181 3813
1163 342 3814
31 197 3815
347 384 3816
3305 209 3817
2241 482 3818
321 207 3819
1249 1768 3820
547 395 3821
415 429 3822
187 207 3823
625 635 3824
940 282 3825
243 721 3826
1180 198 3827
492 375 3828
182 10 3829
205 1908 3830
711 1447 3831
2325 595 3832
14 1638 3833
578 10 3834
235 282 3835
15 216 3836
329 3486 3837
329 691 3838
299 26 3839
30 356 3840
647 3812 3841
1294 12 3842
1190 2680 3843
770 197 3844
258 36 3845
176 13 3846
746 785 3847
34 1946 3848
202 2772 3849
74 58 3850
205 1447 3851
739 16 3852
1202 198 3853
1397 15 3854
312 1178 3855
1138 14 3856
2462 30 3857
286 3682 3858
19 213 3859
369 275 3860
1685 452 3861
399 185 3862
274 5 3863
3826 963 3864
63 54 3865
15 878 3866
251 3442 3867
9 311 3868
167 829 3869
265 614 3870
1091 328 3871
203 1256 3872
751 16 3873
335 2569 3874
257 352 3875
1304 204 3876
914 248 3877
44 51 3878
711 11 3879
319 21 3880
3522 366 3881
1765 34 3882
255 13 3883
557 317 3884
362 646 3885
1149 31 3886
291 501 3887
3290 16 3888
1012 1272 3889
2270 6 3890
29 452 3891
1651 587 3892
1006 1060 3893
536 17 3894
27 502 3895
333 31 3896
48 18 3897
1066 433 3898
252 304 3899
520 221 3900
9 504 3901
703 284 3902
525 462 3903
1808 14 3904
821 189 3905
276 405 3906
255 10 3907
179 324 3908
2539 855 3909
188 363 3910
252 633 3911
231 799 3912
267 16 3913
43 47 3914
267 13 3915
267 29 3916
345 15 3917
219 189 3918
17 556 3919
303 12 3920
362 1129 3921
273 210 3922
252 686 3923
1414 454 3924
60 119 3925
7 202 3926
578 1282 3927
576 211 3928
945 7 3929
1202 11 3930
349 12 3931
253 471 3932
1032 9 3933
246 276 3934
25 178 3935
201 396 3936
202 666 3937
257 1185 3938
98 58 3939
210 31 3940
192 25 3941
363 29 3942
374 10 3943
443 55 3944
17 635 3945
260 208 3946
167 272 3947
1101 671 3948
226 400 3949
4 208 3950
211 6 3951
182 761 3952
265 11 3953
203 708 3954
995 221 3955
9 912 3956
1101 425 3957
251 575 3958
19 193 3959
38 29 3960
2006 3847 3961
538 26 3962
44 57 3963
321 717 3964
9 389 3965
308 173 3966
1566 260 3967
297 27 3968
3653 1406 3969
1258 956 3970
11 554 3971
273 906 3972
17 293 3973
2867 177 3974
2791 9 3975
258 2152 3976
873 6 3977
188 429 3978
48 817 3979
362 449 3980
30 375 3981
1507 1064 3982
816 3961 3983
30 311 3984
182 6 3985
273 1191 3986
405 11 3987
179 219 3988
1529 477 3989
1740 15 3990
191 237 3991
244 11 3992
625 356 3993
1120 372 3994
60 73 3995
1904 24 3996
175 433 3997
235 330 3998
5 260 3999
233 817 4000
329 540 4001
3583 840 4002
9 450 4003
2044 197 4004
3749 3983 4005
431 769 4006
511 736 4007
1673 31 4008
803 223 4009
1130 1695 4010
2266 1527 4011
1635 221 4012
1158 927 4013
335 633 4014
263 189 4015
9 388 4016
1507 2092 4017
360 16 4018
15 279 4019
2114 868 4020
1849 1015 4021
427 197 4022
1040 26 4023
260 14 4024
15 285 4025
812 467 4026
1010 61 4027
308 348 4028
506 29 4029
469 680 4030
281 247 4031
170 3275 4032
561 404 4033
826 14 4034
244 341 4035
243 664 4036
1348 593 4037
244 564 4038
308 336 4039
1150 192 4040
3050 302 4041
2891 107 4042
274 11 4043
494 563 4044
8 204 4045
487 2264 4046
4 159 4047
374 29 4048
321 3674 4049
973 294 4050
625 279 4051
885 17 4052
629 289 4053
313 480 4054
2197 257 4055
169 792 4056
261 598 4057
189 198 4058
191 1681 4059
4049 2112 4060
398 697 4061
1310 198 4062
213 173 4063
17 185 4064
448 27 4065
463 16 4066
1317 757 4067
194 185 4068
390 189 4069
27 185 4070
168 676 4071
1786 12 4072
488 176 4073
985 247 4074
182 287 4075
252 935 4076
188 1041 4077
188 280 4078
1377 232 4079
461 3639 4080
472 1371 4081
367 171 4082
3389 54 4083
949 226 4084
292 25 4085
28 556 4086
199 14 4087
177 509 4088
30 185 4089
244 1513 4090
347 33 4091
19 21 4092
313 500 4093
560 199 4094
176 34 4095
252 181 4096
411 276 4097
270 777 4098
1099 554 4099
233 757 4100
411 702 4101
934 337 4102
273 692 4103
170 1958 4104
2707 54 4105
259 44 4106
235 262 4107
335 319 4108
257 189 4109
2068 360 4110
194 388 4111
243 197 4112
19 216 4113
27 24 4114
1453 1200 4115
1233 1226 4116
188 257 4117
441 10 4118
254 207 4119
1101 319 4120
257 355 4121
233 295 4122
262 29 4123
182 958 4124
287 21 4125
408 228 4126
2471 1991 4127
11 446 4128
3688 31 4129
174 1730 4130
2825 24 4131
652 302 4132
558 241 4133
240 192 4134
1893 368 4135
620 231 4136
945 6 4137
200 1851 4138
1320 183 4139
2157 350 4140
2305 526 4141
781 202 4142
25 272 4143
441 208 4144
214 740 4145
438 221 4146
123 116 4147
1314 341 4148
3885 175 4149
174 521 4150
5 435 4151
2822 986 4152
219 217 4153
259 1827 4154
